Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties
The serialization structure for AnalysisModelDesignProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._SteelDesign
The steel code used.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._ConcreteDesign
The concrete code used.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._TimberDesign
The timber code used.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._SteelDesignMethod
The steel design method.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._ConcreteDesignMethod
The concrete design method.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties._TimberDesignMethod
The timber design method.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties.ToStruct(Tekla.Structures.Analysis.AnalysisModelDesignProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties.FromStruct(Tekla.Structures.Analysis.AnalysisModelDesignProperties)
DO NOT USE! For internal usage only!
P: P.